app/Controllers/AdminController.php

    public function index()
    {
        $model = new AdminModel();
        $data['admins'] = $model->findAll();
---
SELECT *
FROM `admin`

    public function store()
    {
        $model = new AdminModel();
        $model->save([
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ]);
---
INSERT INTO `admin` (`name`, `email`, `password`) VALUES ('ando', 'adno@gmail.com', '$2y$10$nnPKnyN5mkpBjrqcxDaEHeZSrR4EqGehwYJTFUaZUAIPEY2iS1AtC')

    public function edit($id)
    {
        $model = new AdminModel();
        $data['admin'] = $model->find($id);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'

    public function delete($id)
    {
        $model = new AdminModel();
        $model->delete($id);
---
DELETE FROM `admin`
WHERE `id` IN ('2')